IDENTIFICATION DIVISION.
PROGRAM-ID. EnregistrerSolde.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT solde ASSIGN TO "solde.txt"
      ORGANIZATION IS LINE SEQUENTIAL
      ACCESS MODE IS SEQUENTIAL
      FILE STATUS IS WS-SOLDE-STATUS.

DATA DIVISION.
FILE SECTION.
FD solde.
01 SoldeRecord.
   05 MYFILLER_S1  PIC X(10).
   05 SoldeValA PIC 9(10)V99.
   05 MYFILLER_S2  PIC X(2).
   05 MYFILLER_S3  PIC X(10).
   05 SoldeValB PIC 9(10)V99.
   05 MYFILLER_S4  PIC X(2).

WORKING-STORAGE SECTION.
01 WS-SOLDE-STATUS PIC XX.

LINKAGE SECTION.
01 SoldeCompteA PIC 9(6)V99.
01 SoldeCompteB PIC 9(6)V99.

PROCEDURE DIVISION USING SoldeCompteA SoldeCompteB.
  OPEN OUTPUT solde
  MOVE "Solde A : " TO MYFILLER_S1
  MOVE SoldeCompteA TO SoldeValA
  MOVE ". " TO MYFILLER_S2
  MOVE "Solde B : " TO MYFILLER_S3
  MOVE SoldeCompteB TO SoldeValB
  MOVE ". " TO MYFILLER_S4
  WRITE SoldeRecord
  CLOSE solde.
